uhnp/src/DataProcessors/ЗакрытиеПериодаМСФО/ЗакрытиеПериодаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗакрытиеПериодаМСФО</name>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаОпераций</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Требуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.ВидыСостоянийРегламентныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Справочно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/Enums/ВидыСостоянийРегламентныхОпераций/ВидыСостоянийРегламентныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСостоянийРегламентныхОпераций</name>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>НеВыполнено</name>
  </enumValues>
  <enumValues>
    <name>ВыполненоСОшибками</name>
  </enumValues>
  <enumValues>
    <name>Пропущено</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/ЗакрытиеПериодаМСФО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОтменитьЗакрытие(СтруктураПараметров, АдресХранилища) Экспорт
	
	Для Каждого СтрокаТаблицы Из СтруктураПараметров.ТаблицаОпераций Цикл
		Если СтрокаТаблицы.Картинка = 1 Тогда
			Продолжить;
		КонецЕсли;
		ОтменитьЭтап(СтрокаТаблицы);
	КонецЦикла;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(
		СтруктураПараметров.ТаблицаОпераций, АдресХранилища);

КонецПроцедуры

Процедура ОтменитьЭтап(СтрокаТаблицы) Экспорт
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.Ссылка) Тогда
		
		ОбъектДокумент = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
		
		Если Не ОбъектДокумент.Проведен Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбъектДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		СтрокаТаблицы.Состояние = Перечисления.ВидыСостоянийРегламентныхОпераций.НеВыполнено;
		СтрокаТаблицы.Проведен = Ложь;
		СтрокаТаблицы.Картинка = 0;
	Исключение
		СтрокаТаблицы.Состояние = Перечисления.ВидыСостоянийРегламентныхОпераций.ВыполненоСОшибками;
		СтрокаТаблицы.Картинка = 3;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьЗакрытие(СтруктураПараметров, АдресХранилища) Экспорт
	
	//МСФОУХ.ЗаблокироватьДокумент(СтруктураПараметров);
	
	Для Каждого СтрокаТаблицы Из СтруктураПараметров.ТаблицаОпераций Цикл
		ОписаниеОшибки = "";
		ЗакрытьЭтап(СтрокаТаблицы, СтруктураПараметров.ПериодРегистрации, СтруктураПараметров.Сценарий, СтруктураПараметров.Организация, ОписаниеОшибки);
		Если СтрокаТаблицы.Картинка = 3 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(СтруктураПараметров.ТаблицаОпераций, АдресХранилища);
	
	//МСФОУХ.РазблокироватьДокумент(СтруктураПараметров);
	
КонецПроцедуры

Процедура ЗакрытьЭтап(СтрокаТаблицы, ПериодРегистрации, Сценарий, Организация, ОписаниеОшибки = "") Экспорт
	
	Если СтрокаТаблицы.Картинка = 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "Требуется") И Не СтрокаТаблицы.Требуется Тогда		
		Возврат;
	КонецЕсли;
		
	ВидОперации = Неопределено;
	Если Не ПустаяСтрока(СтрокаТаблицы.ВидОперации) Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление." + СтрокаТаблицы.ВидОперации);
	КонецЕсли;
	
	ДатаДокумента = КонецДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПериодРегистрации, "ДатаОкончания"));
	
	ЗначенияЗаполнения = Новый Структура(
		"ПериодОтчета, Дата, Сценарий, Организация, ЗаполнитьДокумент, ВидОперации",
		ПериодРегистрации, ДатаДокумента, Сценарий, Организация, Истина, ВидОперации);
		
	Если ЗначениеЗаполнено(СтрокаТаблицы.Ссылка) Тогда
		ОбъектДокумент = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
	Иначе
		ОбъектДокумент = МСФОУХ.НайтиСоздатьРегламентныйДокумент(СтрокаТаблицы.Документ, ЗначенияЗаполнения);
	КонецЕсли;
	
	МСФОУХ.ЗаблокироватьДокумент(ЗначенияЗаполнения, ОбъектДокумент.Метаданные());
	ОбъектДокумент.Заполнить(ЗначенияЗаполнения);
	
	ОбъектДокумент.Дата = ДатаДокумента;
	ОбъектДокумент.Ответственный = Пользователи.ТекущийПользователь();
	ОбъектДокумент.ПериодОтчета = ПериодРегистрации;
	
	Если ОбъектДокумент.ПроверитьЗаполнение() Тогда
		
		Попытка
			
			ОбъектДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			СтрокаТаблицы.Состояние = Перечисления.ВидыСостоянийРегламентныхОпераций.Выполнено;
			СтрокаТаблицы.Ссылка = ОбъектДокумент.Ссылка;
			СтрокаТаблицы.Дата = ОбъектДокумент.Дата;
			СтрокаТаблицы.Ответственный = ОбъектДокумент.Ответственный;
			СтрокаТаблицы.Картинка = 2;
			
		Исключение
			
			СтрокаТаблицы.Состояние = Перечисления.ВидыСостоянийРегламентныхОпераций.ВыполненоСОшибками;
			СтрокаТаблицы.Картинка = 3;
			ОписаниеОшибки = ОписаниеОшибки();
			
		КонецПопытки;
		
	ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.Ссылка) И СтрокаТаблицы.Проведен Тогда
		
		ОбъектДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		СтрокаТаблицы.Состояние = Перечисления.ВидыСостоянийРегламентныхОпераций.ВыполненоСОшибками;
		СтрокаТаблицы.Картинка = 3;
		ОписаниеОшибки = ПолучитьОписаниеОшибкиДляСтроки(СтрокаТаблицы);
		
	Иначе
		
		СтрокаТаблицы.Состояние = Перечисления.ВидыСостоянийРегламентныхОпераций.ВыполненоСОшибками;
		СтрокаТаблицы.Картинка = 3;
		ОписаниеОшибки = ПолучитьОписаниеОшибкиДляСтроки(СтрокаТаблицы);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектДокумент.Ссылка) Тогда
		РазблокироватьДанныеДляРедактирования(ОбъектДокумент.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОписаниеОшибкиДляСтроки(СтрокаТаблицы)
	Возврат СтрШаблон(НСтр("ru = 'Не удалось автоматически заполнить документ %1'"), СтрокаТаблицы.Документ);
КонецФункции

#КонецОбласти

#КонецЕсли
